# Tap
tap 'ivandokov/homebrew-contrib' # https://github.com/ivandokov/phockup

# Packages
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'colordiff'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'goaccess'
brew 'httpie'
brew 'jq'
brew 'kubectl'
brew 'k9s'
brew 'lux' # video downloader https://github.com/iawia002/lux
brew 'ncdu'
brew 'nvim'
brew 'ollama'
brew 'openvpn'
brew 'phockup' # https://github.com/ivandokov/phockup
brew 'pnpm'
brew 'presenterm'
brew 'redis'
brew 'slides'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'wireguard-tools'
brew 'yt-dlp'
brew 'zsh'

# Cask applications
cask 'alfred'
cask 'brave-browser'
cask 'bruno'
cask 'claude'
cask 'deepl'
cask 'db-browser-for-sqlite'
cask 'dropbox'
cask 'github'
cask 'keepassxc'
cask 'obsidian'
cask 'orbstack'
cask 'protonvpn'
cask 'radiola' # A cool, minimal radio app for mac https://github.com/SokoloffA/radiola
cask 'rectangle'
cask 'shifty'
cask 'session-manager-plugin' # useful for awscli
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'zotero'

# Fonts
cask 'font-fira-mono'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
